#include <stdio.h>
#include <stdbool.h> //за използване на boolean
#include <string.h>

int main(){
    // името на масива е указател на първия елемент в паметта
    int arr1[10] = {}; // празен масив
    int arr2[5] = {2, 8, 15, 10, 25}; // масив със зададени стойности
    // ако не зададем стойност на някой елемент, той ще получи стойност 0
    for(int i = 0; i < 10; i++){
        // запълване на масив
        scanf("%d", &arr1[i]);
    }
    for(int i = 9; i >= 0; i--){
        // принтиране в обратен ред
        printf("%d", arr1[i]);
    }

    // СТРИНГОВЕ
    char str[20] = "This is a test"; // 15, заради терминиращата нула накрая
    char S1[10] = {'H', 'e', 'l', 'l', 'o', '\0'}; // задължително с нулата накрая
    char S2[20];
    scanf("%s", S2); // чете до интервал
    scanf("%[^\n]", S2); // ще чете низ, в който има интервали

    fgets(S2, sizeof(S2), stdin); // адреса, размер на буфера, стандарта; прави проверки; ако прочете текст с по-малко символи, ще добави нов ред накрая
    S2[strlen(S2) - 1] = '\0'; // на мястото на последния символ ще се запише терминиращата нула

    // Двумерен масив–матрица
    int matrix[3][4] = {{1, 2, 3, 4}, {5, 6, 7, 8}, {9, 10, 11, 12}};
    matrix[1][2] = 70 // Взимаме 7
    // обхождането става с два вложени цикъла
    
    

}